#include<iostream>
using namespace std;
int main()
{
    int n;//Переменная отвечает за размерность массива
    int pos;//Переменная отвечает за положительные числа
    int neg;//Переменная отвечает за отричцательные числа 

    cin>>n;//Вводим размерность массива
    int arr[n];//Создаем массив из n элементов
    int i,zz,zi = 0;
    while (i<n)//Первый цикл с предусловием <<Пока переменная i не будет равна конечному индексу в массиве>>
    {
        cin>>arr[i];//Вводятся значение для элемента массива
        i++;//i увеличивается с каждой итерацией цикла 
    }
    while (zz<n)//Цикл для вывода массива со значениями, от 0 до N-го элемента 
    {
        cout<<arr[zz]<<" ";//Вывод 
        zz++;
    }
    while (zi<n)//Цикл для проверки положительный или отрицательный элемент  
    {
    
        if(arr[zi]>0)
        {
            pos++;//Если элемент положительный, переменная pos увеличивается на 1 т.е кол-во положительных элементов увеличивается на 1
        } 
        else
        {
            neg++;//Если элемент отрицательный, переменная neg увеличивается на 1 т.е кол-во отрицетельных элементов увеличивается на 1 
        }
    }
    cout<<endl;//Отступ
    if(pos>0 && neg>0){ //Проверка, если есть положительный и отрицательный элементы, то выводится <<Такие элементы есть>>
        cout<<"Your array have pos and neg elements"<<endl;
    }
    if(pos>0 && neg==0){//Проверка, если есть только положительный элемент, то выводится <<Есть только положительные элементы>>
        cout<<"Your array have only pos elemetns"<<endl;
    }
    if(pos==0 && neg>0){//Проверка, если есть только отрицательный элемент, то выводится <<Есть только отрицательные элементы>>
        cout<<"Your array have only neg elements"<<endl;
    }
    return 0;
}
